import {
  CustomImg,
  Wrap,
  Title,
  Descr,
  List,
  Item,
  Info,
  Price,
  Details,
} from "./Choice.styled";
import img1 from "../../image/img1.jpg";
import img2 from "../../image/img2.jpg";
import img3 from "../../image/img3.jpg";
import img4 from "../../image/img4.jpg";
import img5 from "../../image/img5.jpg";

export default function Choise() {
  return (
    <Wrap>
      <Title>Клінінг тротуарної плитки</Title>
      <Descr>Перелік наших послуг</Descr>
      <List>
        <Item imgUrl={img1}>
          <CustomImg imgUrl={img1} />
          <Info>Клінінг тротуарної плитки</Info>
          <Price>від 70 грн/м2</Price>
          <Details>
            Ми пропонуємо комплексну професійну читку тротуарної плитки від
            різноманітних забруднень.
          </Details>
        </Item>
        <Item imgUrl={img3}>
          <CustomImg imgUrl={img3} />
          <Info>Видалення висолів</Info>
          <Price>від 100 грн/м2</Price>
          <Details>
            При видаленні висолів ми використовуємо відповідні хімічні препарати
            та низку інших методів. Помилково наносити просочення BLACKSTONE без
            попереднього очищення. У разі такого забруднення потрібно
            скористатися послугами професіоналів, оскільки щоб позбутися висолів
            потрібно мати необхідні знання.
          </Details>
        </Item>
        <Item imgUrl={img2}>
          <CustomImg imgUrl={img2} />
          <Info>Очищення прибудинкової території</Info>
          <Price>від 50 грн/м2</Price>
          <Details>
            Якщо у вас у дворі на тротуарній плитці є різні плями від
            автомобільної олії, сліди шин або жирної їжі в зоні барбекю, а між
            плитками вже росте трава - вам потрібно терміново цього позбутися.
            Ми, як професіонали своєї справи, допоможемо вам із цим.
          </Details>
        </Item>
        <Item imgUrl={img5}>
          <CustomImg imgUrl={img5} />
          <Info>Прибирання тротуарної плитки після будівельників</Info>
          <Price>від 100 грн/м2</Price>
          <Details>
            Іноді будівельні компанії не можуть надати послугу післябудівельного
            прибирання. Тому в такій ситуації найкраще скористатися послугами
            кваліфікованої та досвідченої компанії. Як фахівці в цій галузі, ми
            можемо допомогти вам упорядкувати територію навколо будинку, щоб ви
            могли насолоджуватися порядком.
          </Details>
        </Item>
        <Item imgUrl={img4}>
          <CustomImg imgUrl={img4} />
          <Info>Видалення різних забруднень із тротуарної плитки</Info>
          <Price>від 80 грн/м2</Price>
          <Details>
            Якщо у вас є неприємні плями на тротуарній плитці, яких ви не можете
            позбутися самостійно, і вони псують естетику двору – ми зробимо це
            для вас. У нас є все необхідне обладнання та засоби.
          </Details>
        </Item>
      </List>
    </Wrap>
  );
}
